Revit 2027 API
IFCData.AsString Method
 Gets storage value as string when its PrimitiveType is string, binary or enumeration.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string AsString()
Public Function AsString As String
public:
String^ AsString()
member AsString : unit -> string
Return Value
String
 The string value.
Exceptions
Exception | Condition
InapplicableDataException |  The primitive type is not string, binary or enumeration.
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace